node {
  name: "Variable/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Variable"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Variable/Assign"
  op: "Assign"
  input: "Variable"
  input: "Variable/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Variable/read"
  op: "Identity"
  input: "Variable"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Variable"
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "phase_train"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "image_paths"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "FIFOQueueV2"
  op: "FIFOQueueV2"
  attr {
    key: "capacity"
    value {
      i: 200000
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "FIFOQueueV2_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "FIFOQueueV2"
  input: "image_paths"
  input: "labels"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "FIFOQueueV2_Dequeue"
  op: "QueueDequeueV2"
  input: "FIFOQueueV2"
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "unstack"
  op: "Unpack"
  input: "FIFOQueueV2_Dequeue"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "ReadFile"
  op: "ReadFile"
  input: "unstack"
}
node {
  name: "decode_image/Substr/pos"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "decode_image/Substr/len"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/Substr"
  op: "Substr"
  input: "ReadFile"
  input: "decode_image/Substr/pos"
  input: "decode_image/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/is_jpeg/Substr/pos"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "decode_image/is_jpeg/Substr/len"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/is_jpeg/Substr"
  op: "Substr"
  input: "ReadFile"
  input: "decode_image/is_jpeg/Substr/pos"
  input: "decode_image/is_jpeg/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/is_jpeg/Equal/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "\377\330\377"
      }
    }
  }
}
node {
  name: "decode_image/is_jpeg/Equal"
  op: "Equal"
  input: "decode_image/is_jpeg/Substr"
  input: "decode_image/is_jpeg/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "decode_image/cond_jpeg/Switch"
  op: "Switch"
  input: "decode_image/is_jpeg/Equal"
  input: "decode_image/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/switch_t"
  op: "Identity"
  input: "decode_image/cond_jpeg/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/switch_f"
  op: "Identity"
  input: "decode_image/cond_jpeg/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/pred_id"
  op: "Identity"
  input: "decode_image/is_jpeg/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/check_jpeg_channels/x"
  op: "Const"
  input: "^decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/check_jpeg_channels/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/check_jpeg_channels"
  op: "NotEqual"
  input: "decode_image/cond_jpeg/check_jpeg_channels/x"
  input: "decode_image/cond_jpeg/check_jpeg_channels/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/cond_jpeg/Assert/Const"
  op: "Const"
  input: "^decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 1, 3) when decoding JPEG images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/Assert/Assert/data_0"
  op: "Const"
  input: "^decode_image/cond_jpeg/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 1, 3) when decoding JPEG images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/Assert/Assert"
  op: "Assert"
  input: "decode_image/cond_jpeg/check_jpeg_channels"
  input: "decode_image/cond_jpeg/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "decode_image/cond_jpeg/DecodeJpeg"
  op: "DecodeJpeg"
  input: "decode_image/cond_jpeg/DecodeJpeg/Switch:1"
  input: "^decode_image/cond_jpeg/Assert/Assert"
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "decode_image/cond_jpeg/DecodeJpeg/Switch"
  op: "Switch"
  input: "ReadFile"
  input: "decode_image/cond_jpeg/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/is_png/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "\211PN"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/is_png"
  op: "Equal"
  input: "decode_image/cond_jpeg/is_png/Switch"
  input: "decode_image/cond_jpeg/is_png/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "decode_image/cond_jpeg/is_png/Switch"
  op: "Switch"
  input: "decode_image/Substr"
  input: "decode_image/cond_jpeg/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@decode_image/Substr"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/Switch"
  op: "Switch"
  input: "decode_image/cond_jpeg/is_png"
  input: "decode_image/cond_jpeg/is_png"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/switch_t"
  op: "Identity"
  input: "decode_image/cond_jpeg/cond_png/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/switch_f"
  op: "Identity"
  input: "decode_image/cond_jpeg/cond_png/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/pred_id"
  op: "Identity"
  input: "decode_image/cond_jpeg/is_png"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/DecodePng"
  op: "DecodePng"
  input: "decode_image/cond_jpeg/cond_png/DecodePng/Switch_1:1"
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/DecodePng/Switch"
  op: "Switch"
  input: "ReadFile"
  input: "decode_image/cond_jpeg/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/DecodePng/Switch_1"
  op: "Switch"
  input: "decode_image/cond_jpeg/cond_png/DecodePng/Switch"
  input: "decode_image/cond_jpeg/cond_png/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/is_gif/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "GIF"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/is_gif"
  op: "Equal"
  input: "decode_image/cond_jpeg/cond_png/is_gif/Switch"
  input: "decode_image/cond_jpeg/cond_png/is_gif/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/is_gif/Switch"
  op: "Switch"
  input: "decode_image/cond_jpeg/is_png/Switch"
  input: "decode_image/cond_jpeg/cond_png/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@decode_image/Substr"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Switch"
  op: "Switch"
  input: "decode_image/cond_jpeg/cond_png/is_gif"
  input: "decode_image/cond_jpeg/cond_png/is_gif"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  op: "Identity"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  op: "Identity"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/pred_id"
  op: "Identity"
  input: "decode_image/cond_jpeg/cond_png/is_gif"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels/x"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels"
  op: "NotEqual"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels/x"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1/x"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1"
  op: "NotEqual"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1/x"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/LogicalAnd"
  op: "LogicalAnd"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_gif_channels_1"
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert/Const"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 3) when decoding GIF images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert/Assert/data_0"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 3) when decoding GIF images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert/Assert"
  op: "Assert"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/LogicalAnd"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif"
  op: "DecodeGif"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif/Switch_1:1"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/Assert/Assert"
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif/Switch"
  op: "Switch"
  input: "decode_image/cond_jpeg/cond_png/DecodePng/Switch"
  input: "decode_image/cond_jpeg/cond_png/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif/Switch_1"
  op: "Switch"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif/Switch"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/pos"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/len"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Substr"
  op: "Substr"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/Switch"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/pos"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/len"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/Switch"
  op: "Switch"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif/Switch"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/pred_id"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ReadFile"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/is_bmp/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "BM"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/is_bmp"
  op: "Equal"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Substr"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/is_bmp/y"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_1/Const"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Unable to decode bytes as JPEG, PNG, GIF, or BMP"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_1/Assert/data_0"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Unable to decode bytes as JPEG, PNG, GIF, or BMP"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_1/Assert"
  op: "Assert"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/is_bmp"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_1/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels/x"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels/y"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels"
  op: "NotEqual"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels/x"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_2/Const"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 3) when decoding BMP images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_2/Assert/data_0"
  op: "Const"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Channels must be in (None, 0, 3) when decoding BMP images"
      }
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_2/Assert"
  op: "Assert"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/check_channels"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Assert_2/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeBmp"
  op: "DecodeBmp"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Substr/Switch"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/Assert_1/Assert"
  input: "^decode_image/cond_jpeg/cond_png/cond_gif/Assert_2/Assert"
  attr {
    key: "channels"
    value {
      i: 0
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/cond_gif/Merge"
  op: "Merge"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeBmp"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/DecodeGif"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "decode_image/cond_jpeg/cond_png/Merge"
  op: "Merge"
  input: "decode_image/cond_jpeg/cond_png/cond_gif/Merge"
  input: "decode_image/cond_jpeg/cond_png/DecodePng"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "decode_image/cond_jpeg/Merge"
  op: "Merge"
  input: "decode_image/cond_jpeg/cond_png/Merge"
  input: "decode_image/cond_jpeg/DecodeJpeg"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/ExpandDims"
  op: "ExpandDims"
  input: "decode_image/cond_jpeg/Merge"
  input: "resize_image_with_crop_or_pad/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Shape"
  op: "Shape"
  input: "resize_image_with_crop_or_pad/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/Less"
  op: "Less"
  input: "resize_image_with_crop_or_pad/assert_positive/Const"
  input: "resize_image_with_crop_or_pad/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/All"
  op: "All"
  input: "resize_image_with_crop_or_pad/assert_positive/assert_less/Less"
  input: "resize_image_with_crop_or_pad/assert_positive/assert_less/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "all dims of \'image.shape\' must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "all dims of \'image.shape\' must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/assert_positive/assert_less/Assert/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/assert_positive/assert_less/All"
  input: "resize_image_with_crop_or_pad/assert_positive/assert_less/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/control_dependency"
  op: "Identity"
  input: "resize_image_with_crop_or_pad/ExpandDims"
  input: "^resize_image_with_crop_or_pad/assert_positive/assert_less/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@resize_image_with_crop_or_pad/ExpandDims"
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Shape_1"
  op: "Shape"
  input: "resize_image_with_crop_or_pad/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/unstack"
  op: "Unpack"
  input: "resize_image_with_crop_or_pad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 4
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/sub"
  op: "Sub"
  input: "resize_image_with_crop_or_pad/sub/x"
  input: "resize_image_with_crop_or_pad/unstack:2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Neg"
  op: "Neg"
  input: "resize_image_with_crop_or_pad/sub"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv"
  op: "FloorDiv"
  input: "resize_image_with_crop_or_pad/Neg"
  input: "resize_image_with_crop_or_pad/floordiv/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum"
  op: "Maximum"
  input: "resize_image_with_crop_or_pad/floordiv"
  input: "resize_image_with_crop_or_pad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_1"
  op: "FloorDiv"
  input: "resize_image_with_crop_or_pad/sub"
  input: "resize_image_with_crop_or_pad/floordiv_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_1"
  op: "Maximum"
  input: "resize_image_with_crop_or_pad/floordiv_1"
  input: "resize_image_with_crop_or_pad/Maximum_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/sub_1/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/sub_1"
  op: "Sub"
  input: "resize_image_with_crop_or_pad/sub_1/x"
  input: "resize_image_with_crop_or_pad/unstack:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Neg_1"
  op: "Neg"
  input: "resize_image_with_crop_or_pad/sub_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_2"
  op: "FloorDiv"
  input: "resize_image_with_crop_or_pad/Neg_1"
  input: "resize_image_with_crop_or_pad/floordiv_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_2"
  op: "Maximum"
  input: "resize_image_with_crop_or_pad/floordiv_2"
  input: "resize_image_with_crop_or_pad/Maximum_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/floordiv_3"
  op: "FloorDiv"
  input: "resize_image_with_crop_or_pad/sub_1"
  input: "resize_image_with_crop_or_pad/floordiv_3/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Maximum_3"
  op: "Maximum"
  input: "resize_image_with_crop_or_pad/floordiv_3"
  input: "resize_image_with_crop_or_pad/Maximum_3/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Minimum/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Minimum"
  op: "Minimum"
  input: "resize_image_with_crop_or_pad/Minimum/x"
  input: "resize_image_with_crop_or_pad/unstack:1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Minimum_1/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/Minimum_1"
  op: "Minimum"
  input: "resize_image_with_crop_or_pad/Minimum_1/x"
  input: "resize_image_with_crop_or_pad/unstack:2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Shape"
  op: "Shape"
  input: "resize_image_with_crop_or_pad/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Less"
  op: "Less"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/Const"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/All"
  op: "All"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Less"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "all dims of \'image.shape\' must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "all dims of \'image.shape\' must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Assert/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/All"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/assert_positive/assert_less/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Shape_1"
  op: "Shape"
  input: "resize_image_with_crop_or_pad/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/unstack"
  op: "Unpack"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 4
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual"
  op: "GreaterEqual"
  input: "resize_image_with_crop_or_pad/Maximum"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "offset_width must be >= 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "offset_width must be >= 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_1"
  op: "GreaterEqual"
  input: "resize_image_with_crop_or_pad/Maximum_2"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "offset_height must be >= 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_1/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "offset_height must be >= 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_1/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_1"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_1/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater"
  op: "Greater"
  input: "resize_image_with_crop_or_pad/Minimum_1"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_2/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "target_width must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_2/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "target_width must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_2/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_2/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater_1"
  op: "Greater"
  input: "resize_image_with_crop_or_pad/Minimum"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_3/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "target_height must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_3/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "target_height must be > 0."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_3/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Greater_1"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_3/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/add"
  op: "Add"
  input: "resize_image_with_crop_or_pad/Minimum_1"
  input: "resize_image_with_crop_or_pad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_2"
  op: "GreaterEqual"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/unstack:2"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_4/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "width must be >= target + offset."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_4/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "width must be >= target + offset."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_4/Assert"
  op: "Assert"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_2"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_4/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/add_1"
  op: "Add"
  input: "resize_image_with_crop_or_pad/Minimum"
  input: "resize_image_with_crop_or_pad/Maximum_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/GreaterEqual_3"
  op: "GreaterEqual"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/unstack:1"
  input: "resize_image_with_crop_or_pad/crop_to_bounding_box/add_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_5/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "height must be >= target + offset."
      }
    }
  }
}
node {
  name: "resize_image_with_crop_or_pad/crop_to_bounding_box/Assert_5/Assert/data_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
